"""
Алгоритмическая сложность или О большое, что это.
Операции чтения, вставки и удаления элементов в строенных структурах.
Наихудший случай.
"""
# Алгоритмическая сложность или О большое.

# O(n)
for a in [1, 2, 3]:
    print(a)


# O(n^2)
for a in [1, 2, 3]:
    for b in [3, 5, 6]:
        print(a + b)


# O(2n)
for a in [1, 2, 3]:
    print(a)
for b in [3, 5, 6]:
    print(a + b)

# АС вставки в начало списка
# АС вставки в середину списка
# удаление элемента в множестве/списке/словаре
# чтение элемента в множестве/списке/словаре
# проверка на вхождение в множестве/списке/словаре
# сложность вставки элемента в список(конец)/множество/словарь
